Repository: sakurassweets/sakurassweets-backend
Catalog: core/locale/*/LC_MESSAGES/django.po
Languages: uk

source: Email name
uk: Ім`я email адреси

source: Email domain
uk: Ім`я домену

source: Domain should not contain an underscore.
uk: Домен не повинен мати нижнього тире.

source: Email domain name
uk: Ім`я домену

source: Email contains some unallowed special characters.
uk: Email має недозволенні спеціальні символи.

source: Email should not contain unallowed special characters.
uk: Email не повинен мати недозволенні спеціальні символи.

source: Domain address should not contain any special characters
uk: Доменна адреса не може містити будь-які спеціальні символи.

source: Domain address should not contain any digits
uk: Доменна адреса не може містити будь-які числа.

source: Domain address should contain at least 2 characters
uk: Доменна адреса повинна складатись як мінімум з 2 символів.

source: Domain address should contain maximum 6 characters
uk: Доменна адреса може мати максимум 6 символів.

source: Email domain address should not contain special characters, any digits, should contain at least 2 characters and maximum 6 characters
uk: Доменна адреса не повинна мати будь-які спеціальні символи, будь-які цифри та повинна мати від 2 до 6 символів.

source: Email domain address
uk: Ім`я доменного адресу

source: %(object)s can't start or end with '%(symbols)s' symbols.
uk: %(object)s не можуть починатись або закінчуватись символами '%(symbols)s'.

source: %(object)s should have at least one non-digit character.
uk: %(object)s повинно мати хоча б один не числовий символ.

source: %(object)s shouldn't start or end with '%(symbols)s' symbols.
uk: %(object)s не можуть починатись або закінчуватись символами '%(symbols)s'.

source: Your email have %(value)d '@' symbols, only 1 allowed.
uk: Ваш email має %(value)d символи '@', але лише 1 дозволенно.

source: Your email doesn't have any '@' symbol.
uk: Ваш email немає жодного символу '@'.

source: Domain should contain domain name and domain address splitted by dot
uk: Домен повинен складатись з доменного імені та доменної адреси розділених крапкою.

source: You'r %(object)s contains too many special characters in a row
uk: Ваше %(object)s має забагато спеціальних символів підряд.

source: Your email should have only 1 '@' symbol
uk: Ваш email повинен мати лише 1 символ '@'.

source: Only latin characters allowed in password
uk: Лише латинські літери дозволенні у паролі.

source: Password must contain only latin characters
uk: Пароль може містити лише латинські літери.

source: Password must be at least %(value)s characters long. Got %(len)s instead.
uk: Пароль повинен мати як мінімум %(value)s символів. Отримано лише %(len)s символів.

source: Password must be shorter than %(value)s characters long. Got %(len)s instead.
uk: Пароль повинен бути коротший %(value)s символів. Отримано %(len)s символів.

source: Your password should have minimum %(min_len)d characters and maximum %(max_len)d characters
uk: Ваш пароль повинен мати від %(min_len)d до %(max_len)d символів

source: Password must contain at least %(min_upper)d uppercase letter and %(min_lower)d lowercase letter.
uk: Пароль повинен мати як мінімум %(min_upper)d символ верхнього регістру та %(min_lower)d символ нижнього регістру.

source: Your password must contain at least %(min_upper)d uppercase letter and %(min_lower)d lowercase letter.
uk: Пароль повинен мати як мінімум %(min_upper)d символ верхнього регістру та %(min_lower)d символ нижнього регістру.

source: Password should not contain any spacebars.
uk: Пароль не може містити пробіли.

source: Your password should not contain any spacebars.
uk: Ваш пароль не повинен містити пробіли.

source: Password should contain at least %(value)d digit.
uk: Пароль повинен містити як мінімум %(value)d цифру.

source: You`r password should contain at least %(value)d digit.
uk: Ваш пароль повинен містити як мінімум %(value)d цифру.

source: Email should be not None.
uk: Email не може бути None.

source: Password should be not None.
uk: Пароль не може бути None.

source: You'r email can't be same as previous one.
uk: Новий пароль не може бути такий самий, як минулий.

source: You have no permission to update this user
uk: У Вас немає прав для оновлення цього користувача

source: New password can't be the same as old one.
uk: Новий пароль не може бути такий самий, як минулий.

source: You should send at least any data.
uk: Ви повинні відправити хочаб якісь данні.

source: This field can't be empty.
uk: Це поле не може бути пустим.

source: This field is required
uk: Це поле обов`язково.

source: Something went wrong during user delition
uk: Щось пішло не так під час видалення користувача

source: You have no permission to delete this user
uk: У Вас немає прав для видалення цього користувача
